"""
Дана строка. Замените в этой строке все цифры 1 на слово one. Циклы не использовать.
"""

string = '1 man 1 girl 1 dog 1 cat 1 million dollors'
print(string.replace("1", "one"))