"""
 Дана строка. Удалите из этой строки все символы @. Циклы не использовать.
"""

string = '@@@@@@@@@@@@@@@@@@dog@@@@@@@@@@@@@@@@@@'

print(string.replace('@', ''))
